#- Дан список из чисел и число k, необходимо удалить из !исходного списка все вхождения числа k.
WOW=int(input('Введите номер задания: '))
if WOW==1:
    A=[1,2,3,4,4,4,5,6,7,8]
    k=4
    for i in range(len(A)):
        if A[i]==k:
            A.remove(i)
    print(A)

#Дано натуральное число A. Определите, каким по счету числом Фибоначчи оно является, то есть выведите такое число n, что f_n = A. Если А не является числом Фибоначчи, выведите число -1.
elif WOW==2:
    a=int(input())
    if a == 0:
        print(0)
    else:
        p, n = 0, 1
        f = 1
        while n <= a:
            if n == a:
                print(f)
                break
            p, n = n, p + n
            f += 1
        else:
            print(-1)
            
#Дан список, найти в нем второй максимум
elif WOW==3:
    a=[1,2,3,4,5,6,7,8,9]
    b=[]
    k=0
    s=0
    for i in range(len(a)):
        if a[i]>k:
            k=a[i] 
    b=a.remove(k)
    k=a[1]
    for i in range(len(a)):
        if a[i]>k:
            k=a[i] 
    print(k)
    
#Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.
elif WOW==4:
    a=[1,2,3,4,5,6,1,2,3,4,5,6,1,2,3,4,5,6]
    c=0
    for i in range(len(a)):
        for j in range(i+1, len(a)):
            if a[i]==a[j]:
                 c+= 1
    print(c)

#Дан список. Выведите те его элементы, которые встречаются в списке только один раз. Элементы нужно выводить в том порядке, в котором они встречаются в списке.
elif WOW==5:
    a=[1,2,3,4,5,6,7,8,9,10,1,3,5,7,9]
    for i in range(len(a)):
        for j in range(len(a)):
            if i != j and a[i] == a[j]:
                break
        else:
            print(a[i], end=' ')

#Переставьте соседние элементы списка (A[0] c A[1], A[2] c A[3] и т. д.). Если элементов нечетное число, то последний элемент остается на своем месте.
elif WOW==6:
    a=[1,2,3,4,5,6,7,8,9,10]
    for i in range(1, len(a), 2):
        a[i - 1], a[i] = a[i], a[i - 1]
    print(' '.join([str(i) for i in a]))
    
#Дан список из чисел и индекс элемента в списке k. Удалите из списка элемент с индексом k, сдвинув влево все элементы, стоящие правее элемента с индексом k.
#Программа получает на вход список, затем число k. Программа сдвигает все элементы, а после этого удаляет последний элемент списка при помощи метода pop() без параметров. Программа должна осуществлять сдвиг непосредственно в списке, а не делать это при выводе элементов. Также нельзя использовать дополнительный список. Также не следует использовать метод pop(k) с параметром.
elif WOW==7:
    a = [int(s) for s in input().split()]
    k = int(input())
    for i in range(k + 1, len(a)):
        a[i - 1] = a[i]
    a.pop()
    print(' '.join([str(i) for i in a]))

#Дан список целых чисел, число k и значение C. Необходимо вставить в список на позицию с индексом k элемент, равный C, сдвинув все элементы, имевшие индекс не менее k, вправо.
#Поскольку при этом количество элементов в списке увеличивается, после считывания списка в его конец нужно будет добавить новый элемент, используя метод append. Вставку необходимо осуществлять уже в считанном списке, не делая этого при выводе и не создавая дополнительного списка.
elif WOW==8:
    a = [int(s) for s in input().split()]
    k=int(input())
    c=int(input())
    for i in range(len(a) - 1, k, -1):
         a[i] = a[i - 1]    
    a[k]=c
    print(' '.join([str(i) for i in a]))