WOW=int(input('Введите номер задания: '))

#Дан список чисел. Определите, сколько в нем встречается различных чисел.
if WOW==1:
    a=[1,2,3,4,5,6,7,8,1,2,3,4,5,6,7,8]
    print(len(set(a)))

#Даны два списка чисел. Посчитайте, сколько чисел содержится одновременно как в первом списке, так и во втором.
elif WOW==2:
    a=[1,2,3,4,5,6,7,8]
    b=[1,2,3,4,5,6,7,8,9,10,11]
    print(len(set(a) & set(b)))

#Даны два списка чисел. Найдите все числа, которые входят как в первый, так и во второй список и выведите их в порядке возрастания.
elif WOW==3:
    a=[2,1,3,4,5,6]
    b=[1,2,3,4,5,6,7]
    print(*sorted(set(a) & set(b), key=int))

#Во входной строке записана последовательность чисел через пробел. Для каждого числа выведите слово YES (в отдельной строке), если это число ранее встречалось в последовательности или NO, если не встречалось.
elif WOW==4:
    a=[1,2,3,4,5,6,1,2,3,4,5,6,7]
    s=set()
    for i in a:
        if i in s:
            print('YES')
        else:
            print('NO')
            s.add(i)
            
#В единственной строке записан текст. Для каждого слова из данного текста подсчитайте, сколько раз оно встречалось в этом тексте ранее.
#Словом считается последовательность непробельных символов идущих подряд, слова разделены одним или большим числом пробелов или символами конца строки.
elif WOW==5:
    str1ng='abcd abc ab a'
    c={}
    for i in str1ng:
        c[i]=c.get(i, 0) + 1
        print(c[i] - 1, end=' ')